app/controllers/corners_controller.rb

  def index
    @corners = Corner.all
---
SELECT "corners".* FROM "corners"

  def show
    id = params[:id]
    @corner = Corner.where(id: id).first
---
SELECT "corners".* FROM "corners" WHERE "corners"."id" = ? ORDER BY "corners"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_corner
      @corner = Corner.find(params[:id])
---
SELECT "corners".* FROM "corners" WHERE "corners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]